{
  "notifications": [
    {
      "id": "1",
      "title": "Уведомление 1",
      "description": "Произошло какое-то событие",
      "userId": "1"
    },
    {
      "id": "2",
      "title": "Уведомление 2",
      "description": "Произошло какое-то событие",
      "userId": "1",
      "href": "/admin"
    },
    {
      "id": "3",
      "title": "Уведомление 3",
      "description": "Произошло какое-то событие",
      "userId": "1",
      "href": "/admin"
    },
    {
      "id": "4",
      "title": "Уведомление 4",
      "description": "Произошло какое-то событие",
      "userId": "1"
    },
    {
      "id": "5",
      "title": "Уведомление 1",
      "description": "Произошло какое-то событие",
      "userId": "2"
    }
  ],
  "articles": [
    {
      "title": "Тренди у Мобільній Розробці",
      "userId": "1",
      "subtitle": "5 ключових трендів у мобільній розробці, на які варто звернути увагу",
      "img": "https://media.licdn.com/dms/image/D5612AQERw7-m6vjS8g/article-cover_image-shrink_720_1280/0/1690116406938?e=2147483647&v=beta&t=_vg5Fbu8aVoyysfoBj33FY86Xgm4DI6X5GhqwnK3XsM",
      "views": 21,
      "createdAt": "27.04.2024",
      "type": ["MOBILE_DEV"],
      "blocks": [
        {
          "id": "0",
          "type": "TEXT",
          "title": "Вступ",
          "paragraphs": [
            "Мобільна розробка постійно змінюється, пристосовуючись до нових технологій та вимог користувачів. Для того, щоб залишатися в лідерах на цьому ринку, розробники повинні бути в курсі останніх трендів та технологій. Ось кілька  ключових напрямків, на які варто звернути увагу у 2024 році."
          ]
        },
        {
          "id": "1",
          "type": "IMAGE",
          "src": "https://miro.medium.com/v2/resize:fit:1024/1*y5Mv7jm7mjvB6r5ajePfXg.png",
          "title": ""
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Розширена реальність (AR) та Віртуальна реальність (VR)",
          "paragraphs": [
            "Розширена реальність (AR) та віртуальна реальність (VR) представляють потужний потенціал для розробки ігор, принесення їм нового рівня іммерсії та взаємодії з користувачем.",
            "AR дозволяє ігровим розробникам впроваджувати віртуальні об'єкти у реальний світ користувача, створюючи унікальні ігрові досвіди. Гравці можуть взаємодіяти з віртуальними персонажами, предметами та об'єктами прямо в своєму оточенні, що робить гру більш захоплюючою та інтерактивною. Наприклад, гра Pokémon GO використовує AR для того, щоб гравці могли ловити покемонів у реальному світі, використовуючи камеру свого смартфона.",
            "VR, з іншого боку, дозволяє гравцям повністю погрузитися у віртуальний світ, де вони можуть взаємодіяти з навколишнім середовищем, персонажами та об'єктами. Ця технологія створює неймовірно іммерсивні ігрові досвіди, де гравці можуть відчувати себе частиною віртуального світу. Відомий приклад - гра Beat Saber, де гравцям доводиться використовувати світлові мечі, щоб розрізати рухаються об'єкти, підходить ідеально для VR.",
            "Загалом, AR та VR відкривають безліч нових можливостей для розробки ігор, які можуть стати більш інтерактивними, захоплюючими та іммерсивними для гравців."
          ]
        },
        {
          "id": "4",
          "type": "IMAGE",
          "src": "https://media.wired.com/photos/63d1756a49591433ecea86ba/master/pass/Is-Generative-AI-Poised-to-Revolutionize-Game-Development--Not-Yet-Games.jpg",
          "title": ""
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Штучний інтелект (AI) та Машинне навчання (ML)",
          "paragraphs": [
            "Штучний інтелект (AI) та Машинне навчання (ML) відіграють значну роль у сучасній розробці ігор, принесенні нових рівнів глибини та динамічності геймплею.",
            "Однією з основних областей застосування AI та ML є створення ігрових персонажів зі штучним інтелектом, які можуть адаптуватися до дій гравця та середовища. Наприклад, в іграх з великим відкритим світом, таких як \"ГТА\" або \"Ред Дед Редемпшн\", AI може контролювати поведінку неперсонажних героїв, реагуючи на дії гравця та взаємодіючи з ними в природний спосіб.",
            "ML також може бути використане для створення алгоритмів прогнозування поведінки гравців або оптимізації ігрових елементів, щоб забезпечити найбільш задоволення від гри. Наприклад, ML може аналізувати дії гравців у реальному часі та адаптувати рівень складності гри або навіть створювати індивідуальні завдання для кожного гравця залежно від їх стилю гри та вмінь.",
            "Помітний вплив AI та ML також відчутний у графічній складовій ігор. Алгоритми машинного навчання можуть автоматично генерувати текстури, моделі персонажів та анімації, що робить процес розробки ігор більш ефективним та швидким. Крім того, ML може допомогти вдосконалити процес оптимізації графіки, забезпечуючи найкращу якість зображення при мінімальних обчислювальних витратах.",
            "У підсумку, штучний інтелект та машинне навчання відкривають безліч нових можливостей для розробників ігор, дозволяючи створювати більш складні, інтелектуальні та ефективні ігри, які забезпечують неперевершені досвіди для гравців."
          ]
        },
        {
          "id": "6",
          "type": "IMAGE",
          "src": "https://unicsoft.com/wp-content/uploads/2022/07/Create_Blockchain_Game_1440x822.png",
          "title": ""
        },
        {
          "id": "5",
          "type": "TEXT",
          "title": "Блокчейн технології",
          "paragraphs": [
            "Блокчейн технології відкривають нові можливості у сфері розробки ігор, надаючи гравцям більше контролю над їхнім ігровим досвідом та забезпечуючи високий рівень безпеки та прозорості.",
            "Одним з основних аспектів застосування блокчейну в ігровій індустрії є можливість створення унікальних цифрових активів, таких як ігрові предмети, персонажі або навички, які можуть бути власністю гравців. Це відкриває двері для економіки внутрішньої гри, де гравці можуть купувати, продавати або обмінювати ці активи як реальні товари.",
            "Додатково, технологія блокчейну дозволяє розробникам створювати безпечні та прозорі системи обміну, де кожна транзакція ігрових активів реєструється у розподіленому реєстрі, що забезпечує високий рівень безпеки та унеможливлює шахрайство або підробку.",
            "Крім того, блокчейн може бути використаний для створення децентралізованих ігрових платформ, де контроль за ігровими активами та правилами гри знаходиться в руках спільноти гравців, а не централізованих корпорацій. Це дозволяє створювати більш адаптивні та справедливі ігрові середовища, де кожен гравець має рівні можливості.",
            "У підсумку, блокчейн технології відкривають нові горизонти для розробки ігор, дозволяючи створювати більш аутентичні, інноваційні та демократичні ігрові досвіди для гравців."
          ]
        },
        {
          "id": "8",
          "type": "IMAGE",
          "src": "https://images.prismic.io//intuzwebsite/2cd79a86-fb05-40c6-b966-a8cefb853abb_IoT+development+tools+%26+platforms.png?w=1200&q=75&auto=format,compress&fm=png8",
          "title": ""
        },
        {
          "id": "7",
          "type": "TEXT",
          "title": "Інтернет речей (IoT)",
          "paragraphs": [
            "Інтернет речей (IoT) відіграє значну роль у сучасній розробці ігор, надаючи можливість поглиблення іммерсивності та взаємодії гравців з їхнім ігровим середовищем.",
            "Одним з основних аспектів використання IoT в іграх є створення фізичних інтерактивних пристроїв, які співпрацюють з грою. Це може включати в себе різноманітні контролери, датчики руху, віртуальні реальності та інші пристрої, які дозволяють гравцям взаємодіяти з грою у більш природний та захоплюючий спосіб.",
            "Наприклад, в іграх, що використовують віртуальну або розширену реальність, IoT може бути використаний для створення спеціальних контролерів або пристроїв, які взаємодіють з віртуальними об'єктами у реальному світі. Це може включати в себе використання датчиків руху, які реагують на рухи гравця, або спеціальних пристроїв, які дозволяють гравцям взаємодіяти з віртуальними об'єктами у реальному часі.",
            "Крім того, IoT може бути використаний для створення спеціальних ігрових середовищ, які реагують на дії гравців у реальному часі. Наприклад, гра може використовувати датчики руху або датчики звуку, щоб адаптувати геймплей до дій гравців або навіть створювати унікальні ігрові сценарії в залежності від оточуючого середовища.",
            "У підсумку, IoT відкриває нові можливості для створення ігор, які є більш інтерактивними, захоплюючими та іммерсивними для гравців. Ця технологія надає можливість побудови інноваційних ігрових досвідів, які дозволяють гравцям взаємодіяти з їхнім ігровим середовищем у новий та захоплюючий спосіб."
          ]
        }
      ],
      "id": "lc6JSf1"
    },
    {
      "title": "Інтеграція інтелектуальних технологій у сучасну веб-розробку",
      "userId": "1",
      "subtitle": "Використання штучного інтелекту та машинного навчання для створення ефективних та інноваційних веб-додатків",
      "img": "https://xbsoftware.com/wp-content/uploads/2023/03/website-development-process-full-guide-1-fb.jpg",
      "views": 2,
      "createdAt": "27.04.2024",
      "type": ["WEB_DEV"],
      "blocks": [
        {
          "id": "0",
          "type": "TEXT",
          "title": "Вступ",
          "paragraphs": [
            "У сучасному світі веб-розробки технології швидко розвиваються, а вимоги користувачів стають все вищими. Щоб відповісти на ці вимоги та забезпечити високу якість інтерфейсів та функціоналу, веб-розробники все частіше використовують інтелектуальні системи та алгоритми. Інтеграція штучного інтелекту (AI) та машинного навчання (ML) в процес розробки веб-додатків відкриває нові можливості та перетворює стандартні рішення на інноваційні та ефективні інструменти."
          ]
        },
        {
          "id": "1",
          "type": "TEXT",
          "title": "Персоналізація контенту",
          "paragraphs": [
            "Одним з ключових напрямків застосування інтелектуальних технологій у веб-розробці є персоналізація контенту. Для забезпечення кращого користувацького досвіду сайти стають все більш персоналізованими, але вручну керувати цим процесом може бути складно. Тут на допомогу приходять системи AI, які аналізують поведінку користувачів та їхній контентовий споживач, щоб надавати персоналізовані рекомендації та пропозиції. В результаті користувачі отримують контент, який є найбільш цікавим та релевантним для них, що покращує їхній досвід використання веб-сайту або додатку."
          ]
        },
        {
          "id": "2",
          "type": "TEXT",
          "title": "Оптимізація інтерфейсу",
          "paragraphs": [
            "Іншим важливим аспектом інтеграції інтелектуальних технологій у веб-розробку є оптимізація інтерфейсу користувача. ML може використовуватися для аналізу поведінки користувачів та вибору найбільш ефективних дизайнерських рішень, що дозволяє покращити зручність та ефективність взаємодії з інтерфейсом. Наприклад, системи ML можуть автоматично адаптувати розміщення та стиль елементів інтерфейсу для кожного користувача на основі їхніх індивідуальних потреб та вподобань."
          ]
        },
        {
          "id": "3",
          "type": "TEXT",
          "title": "Прогнозування попиту",
          "paragraphs": [
            "Інтелектуальні системи також можуть бути використані для прогнозування попиту на товари та послуги, що дозволяє компаніям планувати свою діяльність та ресурси більш ефективно. Наприклад, на основі аналізу даних про попередні покупки та поведінку користувачів AI може передбачити, які товари будуть найбільш популярними у майбутньому, дозволяючи компаніям попередньо підготувати запаси та рекламні кампанії."
          ]
        },
        {
          "id": "4",
          "type": "TEXT",
          "title": "Заключення",
          "paragraphs": [
            "Інтеграція інтелектуальних технологій у сучасну веб-розробку відкриває безліч можливостей для створення більш ефективних, інноваційних та користувацьких дружніх веб-додатків. Використання систем AI та ML дозволяє покращити персоналізацію контенту, оптимізувати інтерфейс користувача та планувати бізнес-процеси з високою точністю. Такий підхід дозволяє компаніям бути на крок попереду у конкурентній боротьбі на ринку та забезпечувати найвищу якість обслуговування для своїх користувачів."
          ]
        },
        {
          "id": "5",
          "type": "IMAGE",
          "src": "https://litslink.com/wp-content/uploads/2023/04/Benefits-of-AI-Web-Development.png",
          "title": ""
        }
      ],
      "id": "Q89niIO"
    }
  ],
  "comments": [
    {
      "id": "1",
      "text": "some comment",
      "articleId": "1",
      "userId": "1"
    },
    {
      "id": "2",
      "text": "some comment 2",
      "articleId": "1",
      "userId": "1"
    },
    {
      "id": "3",
      "text": "some comment 3",
      "articleId": "1",
      "userId": "2"
    },
    {
      "articleId": "2",
      "userId": "1",
      "text": "awesome!!",
      "id": "gJGTGZO"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "Good job!",
      "id": "ZPPDedw"
    },
    {
      "articleId": "5",
      "userId": "1",
      "text": "Perfect",
      "id": "3-fBCQL"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "awesome",
      "id": "26Q4fCJ"
    },
    {
      "articleId": "1",
      "userId": "1",
      "text": "awesome",
      "id": "wj2pJRn"
    },
    {
      "articleId": "4",
      "userId": "1",
      "text": "Awesome!",
      "id": "q4hPWkK"
    },
    {
      "articleId": "3",
      "userId": "1",
      "text": "perfect!",
      "id": "Z_fwsNZ"
    },
    {
      "articleId": "7",
      "userId": "1",
      "text": "awesome",
      "id": "YxIRjwk"
    }
  ],
  "users": [
    {
      "id": "1",
      "username": "admin",
      "password": "123",
      "firstname": "Gerald",
      "lastname": "Gillium",
      "age": 34,
      "currency": "USD",
      "country": "United States of America",
      "city": "California",
      "roles": ["ADMIN"],
      "features": {
        "isArticleRatingEnabled": true
      },
      "jsonSettings": {
        "theme": "app_dark_theme",
        "isFirstVisit": true
      },
      "avatar": "https://lastfm.freetls.fastly.net/i/u/ar0/87da4c5ba4fb07d6876b53ac496d7ebf.jpg"
    },
    {
      "id": "2",
      "username": "user",
      "password": "123",
      "firstname": "Captain",
      "lastname": "America",
      "age": 93,
      "currency": "USD",
      "country": "United States of America",
      "city": "New York",
      "roles": ["USER"],
      "features": {
        "isArticleRatingEnabled": false
      },
      "jsonSettings": {
        "theme": "app_light_theme"
      },
      "avatar": "https://images.news18.com/ibnlive/uploads/2022/07/chris-evans-16574444474x3.jpg"
    }
  ],
  "article-ratings": [
    {
      "userId": "1",
      "articleId": "14",
      "rate": 3,
      "id": 1
    },
    {
      "userId": "1",
      "articleId": "2",
      "rate": 3,
      "id": 2
    },
    {
      "userId": "1",
      "articleId": "5",
      "rate": 3,
      "id": 3
    },
    {
      "userId": "1",
      "articleId": "6",
      "rate": 3,
      "id": 4
    },
    {
      "userId": "1",
      "articleId": "1",
      "rate": 3,
      "id": 5
    },
    {
      "userId": "1",
      "articleId": "3",
      "rate": 4,
      "id": 6
    },
    {
      "userId": "1",
      "articleId": "17",
      "rate": 2,
      "id": 7
    },
    {
      "userId": "1",
      "articleId": "4",
      "rate": 5,
      "id": 8
    },
    {
      "userId": "1",
      "articleId": "7",
      "rate": 5,
      "id": 9
    },
    {
      "userId": "1",
      "articleId": "9",
      "rate": 4,
      "id": 10
    },
    {
      "userId": "1",
      "articleId": "10",
      "rate": 3,
      "id": 11
    },
    {
      "userId": "1",
      "articleId": "12",
      "rate": 3,
      "id": 12
    },
    {
      "userId": "1",
      "articleId": "13",
      "rate": 2,
      "feedback": "",
      "id": 13
    }
  ]
}
